{"post_id": "1o2bomy", "cluster_id": "binance", "title": "Permanently Banned from Binance P2P After Receiving Verification Emails I Didn’t Request", "author": "sukshma239", "score": 6, "num_comments": 1, "created_utc": 1760029733.0, "url": "https://www.reddit.com/r/binance/comments/1o2bomy/permanently_banned_from_binance_p2p_after/", "permalink": "/r/binance/comments/1o2bomy/permanently_banned_from_binance_p2p_after/", "selftext": "Hi everyone,\n\nI’ve always respected Binance’s strong commitment to security. But recently, I faced a situation that I believe deserves a fair review.\n\nA few days ago, I received several Binance verification code emails that also included my **anti-phishing code**, even though I hadn’t initiated any activity. Following Binance’s own security instructions, I immediately changed my password multiple times to secure my account.\n\nHowever, shortly after doing so, my **P2P access was restricted**. I appealed twice and provided **video recordings of all my P2P transactions** and **screenshots of the verification emails** — but finally received an email confirming that my **P2P access is permanently banned** under the zero-tolerance policy.\n\n👉 I did not engage in any suspicious activity.  \n👉 I strictly followed Binance’s own security advice.  \n👉 Yet, I was penalized for trying to protect my account.\n\nI completely respect Binance’s zero-tolerance and safety rules, but I kindly request the **Security Team** to review this case fairly.\n\nI’ve already opened a Binance Support ticket and shared my registered email privately through official channels. Kindly review this case fairly.\n\n\\#Binance #Security #P2P #Crypto \n\nhttps://preview.redd.it/mdv1nfypa4uf1.png?width=995&amp;format=png&amp;auto=webp&amp;s=3845c4b05fd3b7219b7616e0d0f6b7887f844a93\n\n", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:18.965082"}
{"post_id": "1o2g4o5", "cluster_id": "binance", "title": "New account changing language to Polish when I search for certain cryptos…", "author": "liquidassets33", "score": 1, "num_comments": 1, "created_utc": 1760039909.0, "url": "https://www.reddit.com/r/binance/comments/1o2g4o5/new_account_changing_language_to_polish_when_i/", "permalink": "/r/binance/comments/1o2g4o5/new_account_changing_language_to_polish_when_i/", "selftext": "Hey guys, so I was using the site, 3 days in and everything was going well I put transfered all my crypto to it which is 20k and I want to add alot more but Im scared because I cant get the app since my itunes are american and so i cant get a second layer of security on it…\n\nIts strange, i searched a few cryptos I wanted to buy and the whole website automatically changes to Polish.. but only when I do it to some cryptos, like 10 out of 15 i tried searching, mostly low market cap ones…\n\nWhen i search or try to buy large\nMarket cap cryptos it doesn’t change languages…\n\nReason to worry? ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:18.178335"}
{"post_id": "1o0dfdr", "cluster_id": "binance", "title": "BNB has now become the 3rd largest cryptocurrency by marketcap", "author": "pimpuschimpus", "score": 56, "num_comments": 33, "created_utc": 1759840244.0, "url": "https://www.reddit.com/r/binance/comments/1o0dfdr/bnb_has_now_become_the_3rd_largest_cryptocurrency/", "permalink": "/r/binance/comments/1o0dfdr/bnb_has_now_become_the_3rd_largest_cryptocurrency/", "selftext": "JUST IN: BNB flips $XRP becoming the 3rd largest cryptocurrency in the world by market value.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:18.391798"}
{"post_id": "1nx39he", "cluster_id": "binance", "title": "BNB hits new all-time high at $1,111 as network metrics surge. Here's what's actually driving it.", "author": "dumble_hold_the_door", "score": 19, "num_comments": 5, "created_utc": 1759507518.0, "url": "https://www.reddit.com/r/binance/comments/1nx39he/bnb_hits_new_alltime_high_at_1111_as_network/", "permalink": "/r/binance/comments/1nx39he/bnb_hits_new_alltime_high_at_1111_as_network/", "selftext": "TL;DR: BNB hit a new high around $1,111. Network use is rising, fees just dropped with a 0.05 gwei setting, and regular burns plus some treasury buying help support price. Big plans for faster throughput are on the roadmap; main risk is if usage slows or rivals get better.\n\nBNB reached $1,111.90 on Friday, setting a new all-time high. The token is up 7.4% in 24 hours and 17.5% for the week. This is happening while the broader crypto market also gained, with total market cap rising 1.6% to $4.2 trillion.\n\nThe price movement aligns with what Standard Chartered predicted in May. They forecasted BNB would hit $1,275 in 2025, expecting it to move with Bitcoin and Ethereum gains. We're seeing that pattern play out.\n\nWhat's interesting is the on-chain data backing this up. Per DefiLlama at publication time, BNB Chain's total value locked increased about 2.5% in 24 hours to roughly $8.23 billion. BNB Chain reports record monthly active addresses, and monthly transactions are near cycle highs.\n\nThese aren't just price pumps. The network is actually being used more. When price and usage both increase together, that's typically more sustainable than price moving alone.\n\nSome corporates have announced BNB treasury allocations, and recurring auto-burns have reduced supply. After the previous all-time high in July, analysts noted that treasury activity alongside token burns contributed to price gains. That pattern appears to be continuing.\n\nThe timing coincides with technical upgrades. On Wednesday, BNB Chain validators adopted a new minimum gas price of 0.05 gwei. This makes transactions faster and cheaper for users. The BNB team is now pushing wallets and exchanges to adopt this standard to maintain the chain's competitiveness.\n\nLooking ahead, the roadmap shows aggressive scaling plans. The team wants to increase the block gas limit from 100 million to 1 billion to handle growing demand. By 2026, they're targeting 20,000 transactions per second with confirmation times under 150 milliseconds. They're also planning native privacy features and better developer tools.\n\nTwo major upgrades already happened this year. The Maxwell upgrade in June improved block speed and validator coordination. The Lorentz Hard Fork in April reduced block times and enhanced validator networking for applications that need low latency.\n\nThere was one security issue this week. The official BNB Chain account on X got compromised Wednesday and hackers posted phishing links. The price barely reacted, which suggests the market views it as a temporary security problem rather than a fundamental issue.\n\nThe combination of factors here is notable. You have institutional buying through treasuries, regular token burns reducing supply, network usage hitting records, technical upgrades making the chain faster and cheaper, and ambitious scaling plans for the future.\n\nStandard Chartered's $1,275 target doesn't look unreasonable if these trends continue. That would be about 15% higher from current levels. Whether it happens depends on Bitcoin and Ethereum maintaining their own momentum, since BNB tends to move with the broader market.\n\nThe risk is that network usage could plateau or decline if a competitor offers better performance or lower fees. The 2026 targets of 20,000 transactions per second would be competitive, but other chains are also upgrading. Solana already processes high throughput. Ethereum has its own scaling roadmap.\n\nFor now though, the data supports the price action. Higher usage, institutional accumulation, technical improvements, and positive market conditions are all pointing in the same direction.\n\nIf you're actively trading BNB or using BSC for DeFi, tracking cost basis across multiple buys becomes critical when prices move this much. Been using awaken since last tax season to automatically handle basis tracking and realized gains across BNB trades, gas fees paid in BNB, and BSC DeFi activity. The auto-burn events and corporate treasury flows create enough transaction complexity that manual tracking isn't realistic at any meaningful volume.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:18.391798"}
{"post_id": "1nx80pr", "cluster_id": "binance", "title": "BNB: It’s All in the BTC Ratio", "author": "hduynam99", "score": 13, "num_comments": 2, "created_utc": 1759518142.0, "url": "https://www.reddit.com/r/binance/comments/1nx80pr/bnb_its_all_in_the_btc_ratio/", "permalink": "/r/binance/comments/1nx80pr/bnb_its_all_in_the_btc_ratio/", "selftext": "If you don’t know what coin season is or how to choose your altcoin, I’ve already written about it few weeks ago.\n\nAltcoin season is when alts outperform Bitcoin. Most likely, alt dominance will come back, and the best survivors are the ones that have a history of ratio consolidation.\n\nBNB is a great example of survival. Let’s look at the BNB/BTC ratio monthly chart.\n\n(You can paste it like this on TradingView: CRYPTO:BNBUSD/CRYPTO:BTCUSD)\n\nThe historical cycle:\n\n* During 2018 - 2021: The BNB/BTC ratio formed a double bottom on the monthly chart, consolidated for a while, and then, in the late cycle when alts pumped, it quickly retraced back to its ratio all time high and broke out.\n* This cycle: We can clearly see another double bottom on the ratio in 2024 and early 2025. Q4 is where altcoin season should play out. That gives BNB a high chance of retracing back to its 2022 ratio all time high of 1BNB = 0.0175 BTC.\n\nNow, do the math:\n\nDuring alt season, BTC can easily heat up to the risk zone of 70. According to the Dynamic Risk Range, BTC at 70 \\~ $145K.\n\nSo the possible price of BNB would be:\n\n$145K \\* 0.0175 = $2,537.5\n\nThat’s a modest 200% from the current price. Of course, it could go higher if BTC pushes further into the risk zone.\n\nAnd don’t forget ETH, the blue chip, king of alts. ETH leads alt season: it breaks ATH first, and it usually lasts until the very end of the cycle. In both 2018 and 2021 tops, BNB topped right when ETH was peaking, with ETH risk in the 90 range. It’s reasonable to use the ETH risk metric as ur navigator for altcoins.\n\nI love the survivors, they’ve stood the test of time. The market will always be volatile, but that’s the game. Keep your eyes on the risk metric.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:18.391798"}
{"post_id": "1o2ip4x", "cluster_id": "binance", "title": "Hellp Needed – My Telegram Account Was Blocked Without Explanation", "author": "dovodor", "score": 0, "num_comments": 4, "created_utc": 1760045859.0, "url": "https://www.reddit.com/r/binance/comments/1o2ip4x/hellp_needed_my_telegram_account_was_blocked/", "permalink": "/r/binance/comments/1o2ip4x/hellp_needed_my_telegram_account_was_blocked/", "selftext": "\nHello everyone,\n\nI need your hellp. My Telegram account was suddenly blocked, and I have no idea why. I have used Telegram for many years without any issues, and out of nowhere, access to my account was completely restricted.\n\nI already contacted Telegram support multiple times, explaining the situation, but I received no response. I feel completely ignored, and I don’t understand what happened or why my account was blocked.\n\nI am reaching out to this community for support. I want to:\n\nUnderstand the reason behind the block.\n\nFind ways to regain access to my account safely.\n\nLearn from anyone who has faced a similar situation and succeeded in resolving it.\n\n\nThis block has left me stuck, and I may need to get a new SIM card, which is inconvenient and frustrating. I hope someone here can guide me, share advice, or help escalate this issue.\n\nAny help, suggestions, or shared experiences would be greatly appreciated. Thank you in advance.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:43:19.263264"}
