{"post_id": "1o2rtfo", "cluster_id": "wallstreetbetscrypto", "title": "When crypto hopium turns into real estate dreams 😂", "author": "Characterguru", "score": 14, "num_comments": 2, "created_utc": 1760071844.0, "url": "https://i.redd.it/70iuq9v6t7uf1.png", "permalink": "/r/WallStreetBetsCrypto/comments/1o2rtfo/when_crypto_hopium_turns_into_real_estate_dreams/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:03.519590"}
{"post_id": "1o2bjj6", "cluster_id": "wallstreetbetscrypto", "title": "BTC liquidation heatmap", "author": "YouZealousideal7906", "score": 49, "num_comments": 25, "created_utc": 1760029412.0, "url": "https://i.redd.it/0bopag92b4uf1.jpeg", "permalink": "/r/WallStreetBetsCrypto/comments/1o2bjj6/btc_liquidation_heatmap/", "selftext": "In the bunt for liquidity. The max pain is 119K. If it triggers so 118K is a bounce back or entry level i think. ", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:03.519590"}
{"post_id": "1o2gl3b", "cluster_id": "wallstreetbetscrypto", "title": "Binance should be closed and CZ should be sent back to prison Change my Mind", "author": "Own_Slip_3786", "score": 21, "num_comments": 20, "created_utc": 1760040942.0, "url": "https://i.redd.it/v72a4rra95uf1.jpeg", "permalink": "/r/WallStreetBetsCrypto/comments/1o2gl3b/binance_should_be_closed_and_cz_should_be_sent/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:03.519590"}
{"post_id": "1o25ful", "cluster_id": "wallstreetbetscrypto", "title": "Ethereum underrated", "author": "YouZealousideal7906", "score": 36, "num_comments": 16, "created_utc": 1760015228.0, "url": "https://i.redd.it/mtq3h16w43uf1.jpeg", "permalink": "/r/WallStreetBetsCrypto/comments/1o25ful/ethereum_underrated/", "selftext": "If you have been sleeping on Ethereum which is the second largest cryptocurrency in market cap. Did pull a 2x within 3 months. But the question is what is the remaining potential for this run? Obviously it is supposed to correct or enter bear zone as market has cycles. ", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:02.745041"}
{"post_id": "1o2b25u", "cluster_id": "wallstreetbetscrypto", "title": "Who’s frustrated with this boring market? Let’s scream into the void. I’ll go first. AAAAAAHHHHHHHH", "author": "loud-improvement2", "score": 29, "num_comments": 60, "created_utc": 1760028319.0, "url": "https://www.reddit.com/r/WallStreetBetsCrypto/comments/1o2b25u/whos_frustrated_with_this_boring_market_lets/", "permalink": "/r/WallStreetBetsCrypto/comments/1o2b25u/whos_frustrated_with_this_boring_market_lets/", "selftext": "AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHH", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:02.745041"}
{"post_id": "1nyq7ni", "cluster_id": "wallstreetbetscrypto", "title": "Crypto in 3 months", "author": "KiboShib", "score": 1283, "num_comments": 297, "created_utc": 1759675799.0, "url": "https://i.redd.it/7iep9utg3btf1.png", "permalink": "/r/WallStreetBetsCrypto/comments/1nyq7ni/crypto_in_3_months/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:04.412619"}
{"post_id": "1nwwoch", "cluster_id": "wallstreetbetscrypto", "title": "Bank gave me 0.01% interest… Bitcoin gave me heart attacks but gains", "author": "Cool-Explorer-8510", "score": 238, "num_comments": 9, "created_utc": 1759491420.0, "url": "https://i.redd.it/hpqw2k29vvsf1.jpeg", "permalink": "/r/WallStreetBetsCrypto/comments/1nwwoch/bank_gave_me_001_interest_bitcoin_gave_me_heart/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:04.412619"}
{"post_id": "1o2txe2", "cluster_id": "wallstreetbetscrypto", "title": "Update: I added on-chain data for the pump/dump tool", "author": "obolli", "score": 1, "num_comments": 0, "created_utc": 1760079436.0, "url": "https://v.redd.it/540r0r61f8uf1", "permalink": "/r/WallStreetBetsCrypto/comments/1o2txe2/update_i_added_onchain_data_for_the_pumpdump_tool/", "selftext": "I shared a tool the [other day where you can “time travel”](https://www.reddit.com/r/WallStreetBetsCrypto/comments/1nxqu3a/i_analyzed_every_pump_dump_on_binance_in_the_last/) to each pump and dump on binance in the past 12 months and explore patterns. People seemed to really like it (thank you!).  \nThis is not trading advice; this is data exploration.  \nPlease see the [original post](https://www.reddit.com/r/WallStreetBetsCrypto/comments/1nxqu3a/i_analyzed_every_pump_dump_on_binance_in_the_last/) for more context if you missed it.\n\n# What’s new\n\nI added **on-chain data (**live version only has Ethereum tokens atm but the rest will be added to the frontend as well), I added it directly to the pump and dump tool but you can also visit it at /onchain/.\n\n**How to open it**\n\n1. Go to the [pump/dump explorer like](https://wangr.com/pumpdump) before.\n2. Pick a token. If on-chain data exists (if on eth chain), you’ll see a button.\n3. Click to jump to the **On-Chain** page for that token.\n\nOr you can go directly to: [https://wangr.com/onchain](https://wangr.com/onchain)\n\n# What you’ll see and can investigate\n\n* **Top holders panel:** snapshot of the **top 1%** of wallets and how much of the total supply they control, with quick links to Etherscan for each wallet as well as their token holdings, this lets you see who owns the wallet (the project, an investor or an exchange for example). You'll find DWF Labs and Wintermute in some of them.\n* **Holder distribution chart:** interactive view of “who holds how much” across the whole holder base, how many wallets there are in total, how many “whales”, how many “shrimps” etc.\n* **Lorenz curve:** shows equality at a glance. Note, it’s not pretty for most of these tokens but you can see that more established projects have more equal distributions.\n* **Concentration slider:** flip between **top 10% / 1% / 1%** to see how power consolidates as you climb the ladder.\n* **Wallet deep-dives:** open a large holder’s Etherscan profile, see public labels (exchange, treasury, market maker, etc.), and check what else they hold or are transacting, see their whole portfolio, the power they have in each tokens etc.\n* **Frequent-pump-dump filter:** surface tokens that show up **often** in our event set and scan which labeled wallets appear around those windows.\n* **“Top traders” lens:** for labeled active wallets, view realized profits around events (addresses will be added in next update, for now it’s aggregations).\n\n# Why this is useful (with examples)\n\n# 1) Concentration changes the game\n\nIf a handful of wallets hold most of the supply, **small moves by them = big moves in price**.  \nExample: if the top 3 wallets hold \\~90% of supply, selling 1–2% of their stack can dominate the order book and create a cliff. Same on the way up: coordinated bids or transfers can fuel a face-melter. The **Lorenz curve** puts a number on that intuition, a straight line means equal, a curve means a few hands hold all the wealth (tokens in our case) = power is in very few hands.\n\n# 2) Distribution tells you what kind of market you’re in\n\n* **Balanced distribution:** lots of mid-sized holders, slower “whoosh” moves, manipulation is harder, news flow matters more.\n* **Ultra-concentrated:** everyone else is basically riding along with a few whales. On Etherscan you can explore this further by seeing how they transact with one another. This can be important because they can move the price much more than the news (or sit still).\n\n# 3) Wallet context = due diligence\n\nClick into large holders and labeled entities:\n\n* Is it an exchange wallet or the project treasury? Different risk, context and story.\n* Do the big addresses **actively trade** or do they mostly sit? (found a few crazy wallets, have fun finding them too!)\n* What **other tokens** do these addresses hold? What does their portfolio look like? Are they a whale in all their tokens?\n* Are there inflows/outflows **right before** big price events (match with pump and dump chart to etherscan)?\n\nNone of this tells you what to buy. It tells you **who you’re sitting next to** and how much power they have, so you can calibrate risk and avoid being the exit liquidity for someone else’s decision. And in general it’s just fun to investigate and learn about these things, that’s what data is for. Surface patterns, anomalies and learn\n\nNote you can click on the lorenz curve and it takes you to wikipedia it’s a pretty fun and useful visualization.  \nSad part is, our Lorenz Curves are mostly unequal, but I personally see patterns when I compare bigger more stable projects and the holder data above together with the frequency you can see in the pump and dump data.\n\n# Things to check out\n\n* **Scan a token’s concentration** and compare them across different projects\n* **Profile large holders:** click through, check labels, look at portfolio overlap. How active are they in each? The wallet addresses also show some appetite (or lack thereof)\n* **Watch repeat offenders:** use the frequent-dump filter to find tokens that repeatedly show up as events. Then see which labeled wallets are regularly near them (for now requires manual work on your side, go to etherscan, when I have time I’ll integrate a filter).\n* **Be Sherlock Holmes of crypto** are some of the most profitable traders in the same tokens? Do they trade with one another? Do the exchanges actively (seem to) liquidate people?\n\n# There is still a login but it’s also still free\n\n* **Everything is still** free, I want to know if people find this useful and how much. I promise everything here stays free (as long as the project is alive). I think signing up (giving up your email) is a minimal amount of friction to validate the idea. I’ll keep adding free tools, choosing depending on feedback what to enhance (like how many people sign up), and if enough people find it valuable, I’ll add optional paid tools. Like more detailed onchain data and search. You may notice right now I only show the top 25 holders, it’s possible I’ll keep the full view for anyone who really wants it. Some things like active search take a lot of compute (lots of data) and wouldn’t be workable for me to offer free or would be unusable. If you opt in, I’ll email updates when I ship new features and tools (unsubscribe any time).  Also please note, all the data is available for you for free, that’s the point of the blockchain we can all investigate. What I have done is take some of the labor away and make it easier. But the dashboard takes you quite literally to the data (on etherscan) where you can pretty much find out anything if you’re willing to put in the work.\n\n# Limits (for now)\n\n* **Ethereum only** I’m matching and figuring out how to add and show data from multiple chains for the same token, it’s a bit challenging to make this user friendly.\n* **Labels aren’t perfect.** I surface public labels (Etherscan + open sources). Treat them as directional, not definitive. Verify, etherscan tells you the source of the label, arkham intelligence and others can tell you even more.\n\n# What’s next (near-term roadmap)\n\n* **More chains:** BNB Chain, Solana, and friends.\n* **Whitepaper analysis (my first AI feature!)**\n* **Sentiment layer:** aggregate social/dev/news sentiment around event windows to compare with holder behavior and general analysis\n* **More flags and indicators inside the chart**\n\n# A request\n\nIf you try the new on-chain view, tell me what’s useful vs noise. Let me know what’s confusing and hard to read and how to improve please.\n\n**Disclaimer:** Not financial advice. If you decide to trade off anything here, you can (and probably will) lose money.", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:03.771139"}
{"post_id": "1o2rhq1", "cluster_id": "wallstreetbetscrypto", "title": "Litecoin is about to bitcoin 2.0, tickets running out!!!!", "author": "No1worldchamp", "score": 0, "num_comments": 19, "created_utc": 1760070748.0, "url": "https://www.reddit.com/r/WallStreetBetsCrypto/comments/1o2rhq1/litecoin_is_about_to_bitcoin_20_tickets_running/", "permalink": "/r/WallStreetBetsCrypto/comments/1o2rhq1/litecoin_is_about_to_bitcoin_20_tickets_running/", "selftext": "\nHi All \n\nI think over the next 2-5 years litecoin could get to around 20-40% of bitcoins value. With halvings on the way and supply going down. ETF incoming also, what more can I say! \n\nWho wishes they brought bitcoin back at £100?!?!?!\n\nThis is NFA! \n\nBut I think 2026 is going to be interesting. ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:39:03.771139"}
