{"post_id": "1o25tu4", "cluster_id": "CryptoMarkets", "title": "The Bitcoin 4-Year Cycle is actually Dead. Here's Why.", "author": "hodorrny", "score": 112, "num_comments": 115, "created_utc": 1760016222.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o25tu4/the_bitcoin_4year_cycle_is_actually_dead_heres_why/", "permalink": "/r/CryptoMarkets/comments/1o25tu4/the_bitcoin_4year_cycle_is_actually_dead_heres_why/", "selftext": "Tl;dr: the classic 4-year Bitcoin cycle might be over. It’s not about halvings anymore.. it’s about liquidity. When the Fed cuts rates and China eases, money flows and Bitcoin rises. The next cycle isn’t on a timer, it’s tied to global policy.\n\nSo Arthur Hayes, BitMEX’s cofounder, says the four year Bitcoin cycle that everyone loves to reference might finally be over. And honestly, it makes sense when you look at what’s actually driving markets right now.\n\nMost people still think Bitcoin’s price cycles revolve around halvings, those moments when mining rewards get cut in half every four years. Hayes doesn’t buy it. He says Bitcoin’s movements are tied to one thing above everything else: global liquidity, especially from the United States and China.\n\nWhen you zoom out, his logic checks out. Bitcoin’s early rallies all lined up with periods of easy money, the Fed’s quantitative easing, China’s massive credit growth, and crashes came right after both started tightening. The 2020 to 2021 bull run was fueled by record stimulus and near zero rates. The 2022 bear market was triggered by the Fed’s fastest rate hikes in decades.\n\nBut right now things are shifting again. The Fed already cut rates in September 2025, its first move this cycle, even with inflation still sitting above target. On top of that, the reverse repo balances that had soaked up 2.5 trillion dollars in liquidity since 2022 are basically drained, putting cash right back into markets.\n\nMeanwhile, China is no longer acting as a drag. The People’s Bank of China has been easing rates and reserve requirements to fight off deflation. That combination, looser US policy and mild Chinese stimulus, is a recipe for more liquidity and cheaper money.\n\nHayes summed it up pretty simply: “Money shall be cheaper and more plentiful. Therefore, Bitcoin continues to rise.” It’s not magic or halving cycles anymore, it’s macro.\n\nSome analysts still see patterns that look like the old four year rhythm, but it’s probably just coincidence. The underlying driver has changed. Bitcoin now trades like a liquidity sensitive global asset, not a retail hype machine following a calendar.\n\nThis shift also changes how traders need to think about timing and taxes. When Bitcoin moved on predictable four year cycles, tax planning was straightforward - you could time long term capital gains around halvings. Now that moves are tied to unpredictable central bank decisions, tracking cost basis across multiple entries and exits becomes more critical. Platforms like awaken.tax are seeing this reflected in usage patterns as traders make more frequent portfolio adjustments based on policy signals rather than waiting for halving milestones.\n\nIf Washington or Beijing suddenly tightened again, Bitcoin would correct hard, halving or not. So instead of obsessing over block rewards and countdown clocks, it might be smarter to watch central bank balance sheets and money supply charts.\n\nThe new Bitcoin cycle isn’t four years anymore. It’s whenever the money printers turn on or off.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:40.428826"}
{"post_id": "1o22wnm", "cluster_id": "CryptoMarkets", "title": "Pathetic alt season..", "author": "Straticci4", "score": 21, "num_comments": 65, "created_utc": 1760007697.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o22wnm/pathetic_alt_season/", "permalink": "/r/CryptoMarkets/comments/1o22wnm/pathetic_alt_season/", "selftext": "I'm sure I'm not the only one here but all I hear from so called experts on market cycle theory is alt coin season imminent blah blah blah. I mean a select few moved in 2024 but even now guys like Alex becker still pushing for a crazy alt season and I just don't see it especially if most are expecting a bitcoin top in December. Everyone seems to be moving the goal post on this so called alt season everyone saying rate cuts rate cuts bullish. Yet kf u look back at history most beginning of rate cuts triggered a bear market in the stock market. Not to mention the economy weakening not a single soul I talk to gives a bleep about stocks or crypto. At this point it just feels like coping.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:39.295091"}
{"post_id": "1o26tcx", "cluster_id": "CryptoMarkets", "title": "Binance founder CZ announces that BNB Chain gas fees have dropped by 2000% this year.", "author": "Whole-Kaleidoscope29", "score": 11, "num_comments": 18, "created_utc": 1760018681.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o26tcx/binance_founder_cz_announces_that_bnb_chain_gas/", "permalink": "/r/CryptoMarkets/comments/1o26tcx/binance_founder_cz_announces_that_bnb_chain_gas/", "selftext": "Lower gas fees make the BNB Chain faster and more affordable, encouraging more users and developers to build on the network. Thoughts?", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:39.295091"}
{"post_id": "1nyvt0k", "cluster_id": "CryptoMarkets", "title": "watched bitcoin go from 40k to 125k and somehow made nothing. lost most of it somewhere else instead", "author": "dumble_hold_the_door", "score": 140, "num_comments": 69, "created_utc": 1759688523.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1nyvt0k/watched_bitcoin_go_from_40k_to_125k_and_somehow/", "permalink": "/r/CryptoMarkets/comments/1nyvt0k/watched_bitcoin_go_from_40k_to_125k_and_somehow/", "selftext": "january 2024, bitcoin was around 42k. i kept checking prices every day, waiting for the perfect entry. 45k hit, then 50k, 60k, 70k. every time i thought, “too late, it’ll correct soon.”\n\nfinally bought a small amount at 50k. not much, because this had to be near the top. bitcoin kept climbing anyway. my position barely moved compared to the overall rally.\n\nthat’s when the solana casino started looking tempting. memes, screenshots, 50x overnight gains. bitcoin felt slow, safe, boring.\n\nso i jumped in. first few meme coins worked , doubled here, tripled there. then came the dumps. 80 percent gone in two days. liquidity vanished. stop losses didn’t matter when there was no one to sell to.\n\nmeanwhile bitcoin kept pushing , 80k, 90k, 100k, 120k, 125k. i watched the whole move while trying to make back sol losses.\n\nended up with less than if i’d just bought bitcoin once and forgotten about it.\n\nthe real lesson? checking charts every day doesn’t make you smart, it makes you emotional. you start seeing every dip as danger, every pump as too late, and every sideways move as a waste of time.\n\nyour brain craves bigger moves. bitcoin up 10 percent feels dull. you start needing the casino.\n\nthe ones who made money weren’t on telegram chasing 100x coins. they bought bitcoin, closed the tab, and lived their lives.\n\ni watched bitcoin triple and still ended down... not because i was dumb, but because i paid too much attention.\n\nfunny enough, when i finally started using awaken.tax to sync my trades, i could actually see how much i’d overtraded. every flip, every panic move right there in the report. hurt to look at, but that’s when i learned what “less is more” really means.\n\nstop checking the charts.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:40.820994"}
{"post_id": "1nxs4c9", "cluster_id": "CryptoMarkets", "title": "Btc 2026 bear market", "author": "Revolutionary_Sea159", "score": 105, "num_comments": 296, "created_utc": 1759579303.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1nxs4c9/btc_2026_bear_market/", "permalink": "/r/CryptoMarkets/comments/1nxs4c9/btc_2026_bear_market/", "selftext": "Hi everyone, \n\nBear market is coming in 2026 , probably.\n\nWe are closer to the top than to buttom.\n\nWhat are your predictions for this bear cycle?\n\nWill we see 50k ? 60k? 70k?80k?\n\nI know that no one can see the future.\n\nDo you think the bear market (if it happens) will last\n\n more than 1 year? \n\nPlease share your thoughts and predictions.\n\nThank you!!!!\n \n******This is not financial advice, only\n\n informational******\n\n\n\n", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:40.820994"}
{"post_id": "1o2scjv", "cluster_id": "CryptoMarkets", "title": "Eth to btc", "author": "SteelixTheGoat", "score": 2, "num_comments": 2, "created_utc": 1760073641.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o2scjv/eth_to_btc/", "permalink": "/r/CryptoMarkets/comments/1o2scjv/eth_to_btc/", "selftext": "I’ve made abit of money dollar cost averaging into eth and I believe in its future just feel Bitcoin will hold its value, how far will eth go down this next bear market or is it seen as a store of value now? ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:39.363662"}
{"post_id": "1o2gfae", "cluster_id": "CryptoMarkets", "title": "The Empty Chair: Why Satoshi Nakamoto's Silence is Bitcoin's Loudest Statement. The power doesn’t reside in the chair; it resides everywhere. And that, as Satoshi Nakamoto knew, is the entire point.", "author": "sylsau", "score": 9, "num_comments": 3, "created_utc": 1760040574.0, "url": "https://inbitcoinwetrust.substack.com/p/the-empty-chair-why-satoshi-nakamotos", "permalink": "/r/CryptoMarkets/comments/1o2gfae/the_empty_chair_why_satoshi_nakamotos_silence_is/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:39.363662"}
{"post_id": "1o2rc6i", "cluster_id": "CryptoMarkets", "title": "Do you transfer money after cashing out?", "author": "Several_Structure418", "score": 0, "num_comments": 4, "created_utc": 1760070254.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o2rc6i/do_you_transfer_money_after_cashing_out/", "permalink": "/r/CryptoMarkets/comments/1o2rc6i/do_you_transfer_money_after_cashing_out/", "selftext": "When you are selling on the exchange at various price targets, do you immediately send to the bank or do you wait until everything is cashed out? \nMy concern is maybe my bank not liking these transactions coming in.  ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:37:40.519762"}
