{"post_id": "1o2u8ql", "cluster_id": "cryptocurrencies", "title": "Best or safest decentralized exchange to swap crypto", "author": "natalooski", "score": 1, "num_comments": 0, "created_utc": 1760080608.0, "url": "https://www.reddit.com/r/CryptoCurrencies/comments/1o2u8ql/best_or_safest_decentralized_exchange_to_swap/", "permalink": "/r/CryptoCurrencies/comments/1o2u8ql/best_or_safest_decentralized_exchange_to_swap/", "selftext": "I’m trying to move some BTC into ETH and a few smaller coins, but I don’t want to rely on centralized exchanges anymore. Too many horror stories lately about frozen accounts and forced KYC.  \nWhat’s the best decentralized exchange or swap platform right now that you’ve personally used and trust? I’m mainly looking for something fast, transparent, and not sketchy with rates.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:01.982611"}
{"post_id": "1nyvbja", "cluster_id": "cryptocurrencies", "title": "Anyone here ever tried spending their meme coins or privacy coins?", "author": "Tr3Way_fu", "score": 1, "num_comments": 4, "created_utc": 1759687452.0, "url": "https://www.reddit.com/r/CryptoCurrencies/comments/1nyvbja/anyone_here_ever_tried_spending_their_meme_coins/", "permalink": "/r/CryptoCurrencies/comments/1nyvbja/anyone_here_ever_tried_spending_their_meme_coins/", "selftext": "I’ve been working on a small crypto side project and trying to get a better sense of how people actually use their coins in the real world.\n\nFor anyone who spends crypto instead of just holding it, how often do you use it for things like gift cards or direct purchases? I read that most people cash out their coins directly to fiat.\n\nI’m especially curious about people who hold smaller or less mainstream tokens, like meme coins, privacy coins such as Monero or Zcash, or other community driven projects that have strong followings but aren’t widely supported.\n\nI’m not really talking about the big platforms like Coinsbee or Bitrefill. I mean more about anything that actually supports these smaller ecosystems or gives them a real use case outside of just trading.\n\nFrom what I’ve seen, there’s definitely interest in spending crypto day to day, but most of the tools for doing it still feel kind of rough or incomplete. Has anyone come across something that actually works well for those smaller or niche coins?", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:01.982611"}
{"post_id": "1o250ku", "cluster_id": "Shibainucoin", "title": "Branding is needed. Say positive", "author": "Connect-Top95", "score": 2, "num_comments": 3, "created_utc": 1760014109.0, "url": "/r/SHIBArmy/comments/1o25099/branding_is_needed_say_positive/", "permalink": "/r/Shibainucoin/comments/1o250ku/branding_is_needed_say_positive/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:05.907788"}
{"post_id": "1o13w3w", "cluster_id": "Shibainucoin", "title": "Shibarium Refunds $4 Million After Exploit — Can Shiba Inu Recover?", "author": "yogesh_culkin99", "score": 5, "num_comments": 0, "created_utc": 1759908157.0, "url": "https://cryptonewsland.com/shibarium-refunds-4-million-after-exploit/", "permalink": "/r/Shibainucoin/comments/1o13w3w/shibarium_refunds_4_million_after_exploit_can/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:05.907788"}
{"post_id": "1nwzkkh", "cluster_id": "Shibainucoin", "title": "Looking for The Best IPTV Service in Canada &amp; USA? Here’s My Experience", "author": "LimitAppropriate6435", "score": 30, "num_comments": 44, "created_utc": 1759499086.0, "url": "/r/FreeRobloxAccounts/comments/1nvlmti/looking_for_the_best_iptv_service_in_canada_usa/", "permalink": "/r/Shibainucoin/comments/1nwzkkh/looking_for_the_best_iptv_service_in_canada_usa/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:03.958332"}
{"post_id": "1nyt60k", "cluster_id": "Shibainucoin", "title": "Do you guys seriously believe", "author": "SenpaiRest", "score": 19, "num_comments": 47, "created_utc": 1759682611.0, "url": "https://www.reddit.com/r/Shibainucoin/comments/1nyt60k/do_you_guys_seriously_believe/", "permalink": "/r/Shibainucoin/comments/1nyt60k/do_you_guys_seriously_believe/", "selftext": "That there’s still hope for this, I don’t understand how people are still blindly putting thousands of millions of dollars in this in the hopes of * reaching the moon * I feel bad for you, how can you not see it?", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:03.958332"}
{"post_id": "1o0vp7f", "cluster_id": "Shibainucoin", "title": "Got mooooorrreee", "author": "Valuable_Hold_7718", "score": 5, "num_comments": 1, "created_utc": 1759882125.0, "url": "https://i.redd.it/twnkp7z35stf1.jpeg", "permalink": "/r/Shibainucoin/comments/1o0vp7f/got_mooooorrreee/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:03.958332"}
{"post_id": "1o11f2y", "cluster_id": "Shibainucoin", "title": "Ai marketing", "author": "colu7", "score": 1, "num_comments": 3, "created_utc": 1759899119.0, "url": "https://www.reddit.com/r/Shibainucoin/comments/1o11f2y/ai_marketing/", "permalink": "/r/Shibainucoin/comments/1o11f2y/ai_marketing/", "selftext": "We have the option to \"boost sells\" and attract new investors by moving away from the meme coin status and into functional real by creating marketing campaigns. Why don't we do that? ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:06.385395"}
{"post_id": "1o2bomy", "cluster_id": "binance", "title": "Permanently Banned from Binance P2P After Receiving Verification Emails I Didn’t Request", "author": "sukshma239", "score": 5, "num_comments": 1, "created_utc": 1760029733.0, "url": "https://www.reddit.com/r/binance/comments/1o2bomy/permanently_banned_from_binance_p2p_after/", "permalink": "/r/binance/comments/1o2bomy/permanently_banned_from_binance_p2p_after/", "selftext": "Hi everyone,\n\nI’ve always respected Binance’s strong commitment to security. But recently, I faced a situation that I believe deserves a fair review.\n\nA few days ago, I received several Binance verification code emails that also included my **anti-phishing code**, even though I hadn’t initiated any activity. Following Binance’s own security instructions, I immediately changed my password multiple times to secure my account.\n\nHowever, shortly after doing so, my **P2P access was restricted**. I appealed twice and provided **video recordings of all my P2P transactions** and **screenshots of the verification emails** — but finally received an email confirming that my **P2P access is permanently banned** under the zero-tolerance policy.\n\n👉 I did not engage in any suspicious activity.  \n👉 I strictly followed Binance’s own security advice.  \n👉 Yet, I was penalized for trying to protect my account.\n\nI completely respect Binance’s zero-tolerance and safety rules, but I kindly request the **Security Team** to review this case fairly.\n\nI’ve already opened a Binance Support ticket and shared my registered email privately through official channels. Kindly review this case fairly.\n\n\\#Binance #Security #P2P #Crypto \n\nhttps://preview.redd.it/mdv1nfypa4uf1.png?width=995&amp;format=png&amp;auto=webp&amp;s=3845c4b05fd3b7219b7616e0d0f6b7887f844a93\n\n", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:08.903950"}
{"post_id": "1o2g4o5", "cluster_id": "binance", "title": "New account changing language to Polish when I search for certain cryptos…", "author": "liquidassets33", "score": 1, "num_comments": 1, "created_utc": 1760039909.0, "url": "https://www.reddit.com/r/binance/comments/1o2g4o5/new_account_changing_language_to_polish_when_i/", "permalink": "/r/binance/comments/1o2g4o5/new_account_changing_language_to_polish_when_i/", "selftext": "Hey guys, so I was using the site, 3 days in and everything was going well I put transfered all my crypto to it which is 20k and I want to add alot more but Im scared because I cant get the app since my itunes are american and so i cant get a second layer of security on it…\n\nIts strange, i searched a few cryptos I wanted to buy and the whole website automatically changes to Polish.. but only when I do it to some cryptos, like 10 out of 15 i tried searching, mostly low market cap ones…\n\nWhen i search or try to buy large\nMarket cap cryptos it doesn’t change languages…\n\nReason to worry? ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:07.717311"}
{"post_id": "1o0dfdr", "cluster_id": "binance", "title": "BNB has now become the 3rd largest cryptocurrency by marketcap", "author": "pimpuschimpus", "score": 53, "num_comments": 33, "created_utc": 1759840244.0, "url": "https://www.reddit.com/r/binance/comments/1o0dfdr/bnb_has_now_become_the_3rd_largest_cryptocurrency/", "permalink": "/r/binance/comments/1o0dfdr/bnb_has_now_become_the_3rd_largest_cryptocurrency/", "selftext": "JUST IN: BNB flips $XRP becoming the 3rd largest cryptocurrency in the world by market value.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:08.240844"}
{"post_id": "1nx39he", "cluster_id": "binance", "title": "BNB hits new all-time high at $1,111 as network metrics surge. Here's what's actually driving it.", "author": "dumble_hold_the_door", "score": 20, "num_comments": 5, "created_utc": 1759507518.0, "url": "https://www.reddit.com/r/binance/comments/1nx39he/bnb_hits_new_alltime_high_at_1111_as_network/", "permalink": "/r/binance/comments/1nx39he/bnb_hits_new_alltime_high_at_1111_as_network/", "selftext": "TL;DR: BNB hit a new high around $1,111. Network use is rising, fees just dropped with a 0.05 gwei setting, and regular burns plus some treasury buying help support price. Big plans for faster throughput are on the roadmap; main risk is if usage slows or rivals get better.\n\nBNB reached $1,111.90 on Friday, setting a new all-time high. The token is up 7.4% in 24 hours and 17.5% for the week. This is happening while the broader crypto market also gained, with total market cap rising 1.6% to $4.2 trillion.\n\nThe price movement aligns with what Standard Chartered predicted in May. They forecasted BNB would hit $1,275 in 2025, expecting it to move with Bitcoin and Ethereum gains. We're seeing that pattern play out.\n\nWhat's interesting is the on-chain data backing this up. Per DefiLlama at publication time, BNB Chain's total value locked increased about 2.5% in 24 hours to roughly $8.23 billion. BNB Chain reports record monthly active addresses, and monthly transactions are near cycle highs.\n\nThese aren't just price pumps. The network is actually being used more. When price and usage both increase together, that's typically more sustainable than price moving alone.\n\nSome corporates have announced BNB treasury allocations, and recurring auto-burns have reduced supply. After the previous all-time high in July, analysts noted that treasury activity alongside token burns contributed to price gains. That pattern appears to be continuing.\n\nThe timing coincides with technical upgrades. On Wednesday, BNB Chain validators adopted a new minimum gas price of 0.05 gwei. This makes transactions faster and cheaper for users. The BNB team is now pushing wallets and exchanges to adopt this standard to maintain the chain's competitiveness.\n\nLooking ahead, the roadmap shows aggressive scaling plans. The team wants to increase the block gas limit from 100 million to 1 billion to handle growing demand. By 2026, they're targeting 20,000 transactions per second with confirmation times under 150 milliseconds. They're also planning native privacy features and better developer tools.\n\nTwo major upgrades already happened this year. The Maxwell upgrade in June improved block speed and validator coordination. The Lorentz Hard Fork in April reduced block times and enhanced validator networking for applications that need low latency.\n\nThere was one security issue this week. The official BNB Chain account on X got compromised Wednesday and hackers posted phishing links. The price barely reacted, which suggests the market views it as a temporary security problem rather than a fundamental issue.\n\nThe combination of factors here is notable. You have institutional buying through treasuries, regular token burns reducing supply, network usage hitting records, technical upgrades making the chain faster and cheaper, and ambitious scaling plans for the future.\n\nStandard Chartered's $1,275 target doesn't look unreasonable if these trends continue. That would be about 15% higher from current levels. Whether it happens depends on Bitcoin and Ethereum maintaining their own momentum, since BNB tends to move with the broader market.\n\nThe risk is that network usage could plateau or decline if a competitor offers better performance or lower fees. The 2026 targets of 20,000 transactions per second would be competitive, but other chains are also upgrading. Solana already processes high throughput. Ethereum has its own scaling roadmap.\n\nFor now though, the data supports the price action. Higher usage, institutional accumulation, technical improvements, and positive market conditions are all pointing in the same direction.\n\nIf you're actively trading BNB or using BSC for DeFi, tracking cost basis across multiple buys becomes critical when prices move this much. Been using awaken since last tax season to automatically handle basis tracking and realized gains across BNB trades, gas fees paid in BNB, and BSC DeFi activity. The auto-burn events and corporate treasury flows create enough transaction complexity that manual tracking isn't realistic at any meaningful volume.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:08.240844"}
{"post_id": "1nx80pr", "cluster_id": "binance", "title": "BNB: It’s All in the BTC Ratio", "author": "hduynam99", "score": 12, "num_comments": 2, "created_utc": 1759518142.0, "url": "https://www.reddit.com/r/binance/comments/1nx80pr/bnb_its_all_in_the_btc_ratio/", "permalink": "/r/binance/comments/1nx80pr/bnb_its_all_in_the_btc_ratio/", "selftext": "If you don’t know what coin season is or how to choose your altcoin, I’ve already written about it few weeks ago.\n\nAltcoin season is when alts outperform Bitcoin. Most likely, alt dominance will come back, and the best survivors are the ones that have a history of ratio consolidation.\n\nBNB is a great example of survival. Let’s look at the BNB/BTC ratio monthly chart.\n\n(You can paste it like this on TradingView: CRYPTO:BNBUSD/CRYPTO:BTCUSD)\n\nThe historical cycle:\n\n* During 2018 - 2021: The BNB/BTC ratio formed a double bottom on the monthly chart, consolidated for a while, and then, in the late cycle when alts pumped, it quickly retraced back to its ratio all time high and broke out.\n* This cycle: We can clearly see another double bottom on the ratio in 2024 and early 2025. Q4 is where altcoin season should play out. That gives BNB a high chance of retracing back to its 2022 ratio all time high of 1BNB = 0.0175 BTC.\n\nNow, do the math:\n\nDuring alt season, BTC can easily heat up to the risk zone of 70. According to the Dynamic Risk Range, BTC at 70 \\~ $145K.\n\nSo the possible price of BNB would be:\n\n$145K \\* 0.0175 = $2,537.5\n\nThat’s a modest 200% from the current price. Of course, it could go higher if BTC pushes further into the risk zone.\n\nAnd don’t forget ETH, the blue chip, king of alts. ETH leads alt season: it breaks ATH first, and it usually lasts until the very end of the cycle. In both 2018 and 2021 tops, BNB topped right when ETH was peaking, with ETH risk in the 90 range. It’s reasonable to use the ETH risk metric as ur navigator for altcoins.\n\nI love the survivors, they’ve stood the test of time. The market will always be volatile, but that’s the game. Keep your eyes on the risk metric.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:08.240844"}
{"post_id": "1o2ip4x", "cluster_id": "binance", "title": "Hellp Needed – My Telegram Account Was Blocked Without Explanation", "author": "dovodor", "score": 0, "num_comments": 4, "created_utc": 1760045859.0, "url": "https://www.reddit.com/r/binance/comments/1o2ip4x/hellp_needed_my_telegram_account_was_blocked/", "permalink": "/r/binance/comments/1o2ip4x/hellp_needed_my_telegram_account_was_blocked/", "selftext": "\nHello everyone,\n\nI need your hellp. My Telegram account was suddenly blocked, and I have no idea why. I have used Telegram for many years without any issues, and out of nowhere, access to my account was completely restricted.\n\nI already contacted Telegram support multiple times, explaining the situation, but I received no response. I feel completely ignored, and I don’t understand what happened or why my account was blocked.\n\nI am reaching out to this community for support. I want to:\n\nUnderstand the reason behind the block.\n\nFind ways to regain access to my account safely.\n\nLearn from anyone who has faced a similar situation and succeeded in resolving it.\n\n\nThis block has left me stuck, and I may need to get a new SIM card, which is inconvenient and frustrating. I hope someone here can guide me, share advice, or help escalate this issue.\n\nAny help, suggestions, or shared experiences would be greatly appreciated. Thank you in advance.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:09.113971"}
{"post_id": "1o29n18", "cluster_id": "CryptoCurrency", "title": "Gold Holder vs Bitcoiner", "author": "kirtash93", "score": 1176, "num_comments": 146, "created_utc": 1760025166.0, "url": "https://i.redd.it/7fjwtvkey3uf1.png", "permalink": "/r/CryptoCurrency/comments/1o29n18/gold_holder_vs_bitcoiner/", "selftext": "Source: [https://x.com/naiivememe/status/1976232498310025578](https://x.com/naiivememe/status/1976232498310025578)", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.563065"}
{"post_id": "1o2du78", "cluster_id": "CryptoCurrency", "title": "Which one of you is this", "author": "Wise-Grapefruit-1443", "score": 380, "num_comments": 50, "created_utc": 1760034614.0, "url": "https://i.redd.it/o078aqgfv3uf1.jpeg", "permalink": "/r/CryptoCurrency/comments/1o2du78/which_one_of_you_is_this/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.134160"}
{"post_id": "1o287jt", "cluster_id": "CryptoCurrency", "title": "I've been in this market since 2016 and in crypto even longer (and haven't raged quit yet). Here's what I'm seeing right now from what I've been through before. Sure \"nobody knows shit about fuck\", but after a decade you start to get a feel for this beast.", "author": "fan_of_hakiksexydays", "score": 334, "num_comments": 153, "created_utc": 1760021965.0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/1o287jt/ive_been_in_this_market_since_2016_and_in_crypto/", "permalink": "/r/CryptoCurrency/comments/1o287jt/ive_been_in_this_market_since_2016_and_in_crypto/", "selftext": "Sure \"nobody knows shit about fuck\", and yet people repeat the same mistakes, and the market keeps having familiar things coming back. Not quiet like clockwork, but close enough.\n\nThis is just my personal opinion based on what I learned, so take it with a heap of salt.\n\nIn **bold** is the direct answer.\n\n# Is the bull cycle over?\n\nWith Fed rate cuts just starting? That's highly doubtful.\n\nPlus there's a long list of things going right at the moment.\n\nFor a proper crash and a bubble to burst, you first need a proper bubble.\n\n**We're probably not that far from it, but this market still needs a little more bubble.** Remember, what they say about market irrationality.\n\n# When will the bull cycle end and crash?\n\nFed rates could potentially drag this out longer into early 2026, but don't expect that narrative to stay fresh for too long either.\n\nUltimately, the sooner we get some big rallies, FOMO, and mania (but milder than previous cycles because of tapering volatility), the closer we will be to a crash.\n\nIf this recent rally from $108K to $126K has another leg like that, we won't actually be too far from a proper bubble.\n\nBecause the market loves to create self-fulfilled prophecies, **I would set your clocks for a crash somewhere between mid-November to mid-January**. And clockwork is the one thing that has been somewhat reliable in this market.\n\nEven if everything is rosy at the beginning of 2026, the forces of this market are too strong for a bull market to be extended for too long.\n\n# How high Bitcoin will go?\n\nMake sure you don't look at Bitcoin's history linearly, and start looking at the diminishing returns and tapering down of its volatility. It's a curve.\n\nNow that we're deep in the bull market, the fog is beginning to lift.\n\nFor me the sweet spot of that peak is between **$129K-$149K**. If I had to go with an exact price: $136.9K.\n\nI hope I'm not underestimating FOMO here, and overplaying the \"tapering down\" narrative.\n\n$150K target seems too popular now.\n\n# What about alt season? That's never gonna happen right?\n\nHas no one else seen the glimpses and foreshadowing last November?\n\nIt was very revealing about the nature of the market and how it still behaves with alts. With just enough FOMO in the market, you get people panic buying alts.\n\nThe market has been a little more tamed since, with only one other little injection of FOMO and another alt rally during the summer.\n\nA lower mania phase at the end of Bitcoin's bullrun could spell a milder and shorter alt season.\n\nSo **this alt season could really be milder** with ETH staying under $6K, but other major alts getting maybe only 30%-100% rallies, and a few lucky ones maybe getting 2x-3x. This in a scenario where Bitcoin only hits $136.9K.\n\n**If we get some big BTC mania rally, then yes, there will be some big alt rallies.** Why? Because people are greedy.\n\n# What about the bear winter, is it gonna be as brutal as usual?\n\nBitcoin *should* see its mildest winter. With a maximum drop down by only 60%-70%.\n\nBut what about MSTR, ETFs, big institutions and governments?\n\nIf that stuff implodes, it could create some **shit show** at maybe a higher level than FTX and LUNA.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.134160"}
{"post_id": "1nzyh5p", "cluster_id": "CryptoCurrency", "title": "Which one is it?", "author": "OfficialBONKfun", "score": 6268, "num_comments": 210, "created_utc": 1759792093.0, "url": "https://i.redd.it/54a5za3dpktf1.png", "permalink": "/r/CryptoCurrency/comments/1nzyh5p/which_one_is_it/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.979164"}
{"post_id": "1nyy09z", "cluster_id": "CryptoCurrency", "title": "Satoshi's wallet is now worth over $135B; This would make him the 9th richest person on earth", "author": "Next_Statement6145", "score": 3155, "num_comments": 416, "created_utc": 1759693498.0, "url": "https://www.reddit.com/gallery/1nyy09z", "permalink": "/r/CryptoCurrency/comments/1nyy09z/satoshis_wallet_is_now_worth_over_135b_this_would/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.979164"}
{"post_id": "1ny0xou", "cluster_id": "CryptoCurrency", "title": "Michelangelo Would Be Proud", "author": "goldyluckinblokchain", "score": 2962, "num_comments": 25, "created_utc": 1759601039.0, "url": "https://i.redd.it/qq8vonlax4tf1.jpeg", "permalink": "/r/CryptoCurrency/comments/1ny0xou/michelangelo_would_be_proud/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.979164"}
{"post_id": "1o2pqvg", "cluster_id": "CryptoCurrency", "title": "Governments weighing crypto reserves target $75 billion pot", "author": "Dongerated", "score": 41, "num_comments": 2, "created_utc": 1760065346.0, "url": "https://fortune.com/crypto/2025/10/09/crypto-reserve-75-billion-bitcoin-ethereum-donald-trump/", "permalink": "/r/CryptoCurrency/comments/1o2pqvg/governments_weighing_crypto_reserves_target_75/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:10.738585"}
{"post_id": "1o2uebw", "cluster_id": "CryptoCurrency", "title": "Peru's Largest Bank Partners with BitGo to Launch Crypto-Enabled Banking Platform 'Cryptococos'", "author": "rose98734", "score": 1, "num_comments": 1, "created_utc": 1760081215.0, "url": "https://inleo.io/@uyobong/perus-largest-bank-partners-with-bitgo-to-launch-cryptoenabled-banking-platform-cryptococos-3vi", "permalink": "/r/CryptoCurrency/comments/1o2uebw/perus_largest_bank_partners_with_bitgo_to_launch/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.721642"}
{"post_id": "1o2pse1", "cluster_id": "CryptoCurrency", "title": "President DJT’s Administration Lets Loose the Dogs of Crypto: Dropped Enforcement Cases Give Green Light to Crypto Grifters", "author": "Dongerated", "score": 12, "num_comments": 3, "created_utc": 1760065474.0, "url": "https://ourfinancialsecurity.org/news/blog-trump-administration-lets-loose-the-dogs-of-crypto/", "permalink": "/r/CryptoCurrency/comments/1o2pse1/president_djts_administration_lets_loose_the_dogs/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:11.721642"}
{"post_id": "1o1z6y4", "cluster_id": "crypto", "title": "P2P Whatsapp Clone", "author": "Accurate-Screen8774", "score": 0, "num_comments": 5, "created_utc": 1759993192.0, "url": "https://www.reddit.com/r/crypto/comments/1o1z6y4/p2p_whatsapp_clone/", "permalink": "/r/crypto/comments/1o1z6y4/p2p_whatsapp_clone/", "selftext": "Want to send messages and video calls with:\n\n* no installs\n* no sign-ups\n* no tracking\n* end-to-end encryption\n\nThis new prototype uses PeerJS to establish a secure browser-to-browser connection. Everything is ephemeral and cleared when you refresh the page—true zerodata privacy!\n\nCheck out the [testable demo here](https://p2p.positive-intentions.com/iframe.html?globals=&amp;id=demo-p2p-messaging--p-2-p-messaging&amp;viewMode=story).\n\nI am working towards a look-and-feel to match Whatsapp as seen in this [hardcoded UI demo](http://glitr.positive-intentions.com).\n\nIMPORTANT NOTE: This is still a work-in-progress and a close-source project (so take it with a spoonful of salt). It is based on the open source MVP see [here](https://github.com/positive-intentions/chat). It has NOT been audited or reviewed. For testing purposes only, not a replacement for your current messaging app.\n\n* Docs: [https://positive-intentions.com/docs/category/sparcle](https://positive-intentions.com/docs/category/sparcle)\n* Reddit: [https://www.reddit.com/r/positive\\_intentions](https://www.reddit.com/r/positive_intentions)\n* GitHub: [https://github.com/positive-intentions](https://github.com/positive-intentions)\n* Mastodon: [https://infosec.exchange/@xoron](https://infosec.exchange/@xoron)", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:14.792747"}
{"post_id": "1ny81e3", "cluster_id": "crypto", "title": "The UK Is Still Trying to Backdoor Encryption for Apple Users", "author": "knotdjb", "score": 63, "num_comments": 2, "created_utc": 1759618294.0, "url": "https://www.eff.org/deeplinks/2025/10/uk-still-trying-backdoor-encryption-apple-users", "permalink": "/r/crypto/comments/1ny81e3/the_uk_is_still_trying_to_backdoor_encryption_for/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:13.261076"}
{"post_id": "1nxfq2z", "cluster_id": "crypto", "title": "Signal President Meredith Whittaker urges Germany to not accede to Chat Control", "author": "knotdjb", "score": 36, "num_comments": 0, "created_utc": 1759537326.0, "url": "https://signal.org/blog/pdfs/germany-chat-control.pdf", "permalink": "/r/crypto/comments/1nxfq2z/signal_president_meredith_whittaker_urges_germany/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:13.261076"}
{"post_id": "1o0jm2j", "cluster_id": "crypto", "title": "CryptPad Blog - Europe's future is at stake: Open letter against Chat Control", "author": "Natanael_L", "score": 23, "num_comments": 0, "created_utc": 1759854581.0, "url": "https://blog.cryptpad.org/2025/10/07/open-letter-against-chat-control/", "permalink": "/r/crypto/comments/1o0jm2j/cryptpad_blog_europes_future_is_at_stake_open/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:13.261076"}
{"post_id": "1o1f8gn", "cluster_id": "crypto", "title": "Why the Next AI Revolution Will Be Written in Rust — and Secured with Cryptography", "author": "Ornery_Laugh_8392", "score": 0, "num_comments": 3, "created_utc": 1759940686.0, "url": "https://www.reddit.com/r/crypto/comments/1o1f8gn/why_the_next_ai_revolution_will_be_written_in/", "permalink": "/r/crypto/comments/1o1f8gn/why_the_next_ai_revolution_will_be_written_in/", "selftext": "We’re entering an era where **AI models must be as secure as they are intelligent**.  \nIf your system can think — it can also leak, infer, or be manipulated.\n\nI’ve spent years in blockchain and cryptography — building consensus systems, MPC wallets, and zero-knowledge protocols in **Rust and OCaml**. Now, those same primitives are redefining **secure AI pipelines**:\n\n🧠 *MPC for federated learning*  \n🔐 *Homomorphic encryption for private inference*  \n🧾 *ZK proofs for model verification*  \n🧩 *PKI for model provenance and API trust chains*\n\nRust gives us a **safe and performant foundation** for this — no dangling pointers, no race conditions, no silent memory leaks.\n\nAs cryptographers, we must design **secure primitives for AI systems**: prevent side-channels, enforce constant-time ops, audit entropy sources, and ensure end-to-end encryption — from model to endpoint.\n\nSecurity is no longer just backend engineering — it’s part of **AI design itself**.  \nIf AI is the brain, cryptography is the immune system. Please read this article where i am adding more details : [https://medium.com/@shailamie/securing-the-future-of-ai-cryptographic-protocols-rust-engineering-and-the-next-frontier-of-1ef507caded2](https://medium.com/@shailamie/securing-the-future-of-ai-cryptographic-protocols-rust-engineering-and-the-next-frontier-of-1ef507caded2)", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:13.532938"}
{"post_id": "1o25tu4", "cluster_id": "CryptoMarkets", "title": "The Bitcoin 4-Year Cycle is actually Dead. Here's Why.", "author": "hodorrny", "score": 113, "num_comments": 115, "created_utc": 1760016222.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o25tu4/the_bitcoin_4year_cycle_is_actually_dead_heres_why/", "permalink": "/r/CryptoMarkets/comments/1o25tu4/the_bitcoin_4year_cycle_is_actually_dead_heres_why/", "selftext": "Tl;dr: the classic 4-year Bitcoin cycle might be over. It’s not about halvings anymore.. it’s about liquidity. When the Fed cuts rates and China eases, money flows and Bitcoin rises. The next cycle isn’t on a timer, it’s tied to global policy.\n\nSo Arthur Hayes, BitMEX’s cofounder, says the four year Bitcoin cycle that everyone loves to reference might finally be over. And honestly, it makes sense when you look at what’s actually driving markets right now.\n\nMost people still think Bitcoin’s price cycles revolve around halvings, those moments when mining rewards get cut in half every four years. Hayes doesn’t buy it. He says Bitcoin’s movements are tied to one thing above everything else: global liquidity, especially from the United States and China.\n\nWhen you zoom out, his logic checks out. Bitcoin’s early rallies all lined up with periods of easy money, the Fed’s quantitative easing, China’s massive credit growth, and crashes came right after both started tightening. The 2020 to 2021 bull run was fueled by record stimulus and near zero rates. The 2022 bear market was triggered by the Fed’s fastest rate hikes in decades.\n\nBut right now things are shifting again. The Fed already cut rates in September 2025, its first move this cycle, even with inflation still sitting above target. On top of that, the reverse repo balances that had soaked up 2.5 trillion dollars in liquidity since 2022 are basically drained, putting cash right back into markets.\n\nMeanwhile, China is no longer acting as a drag. The People’s Bank of China has been easing rates and reserve requirements to fight off deflation. That combination, looser US policy and mild Chinese stimulus, is a recipe for more liquidity and cheaper money.\n\nHayes summed it up pretty simply: “Money shall be cheaper and more plentiful. Therefore, Bitcoin continues to rise.” It’s not magic or halving cycles anymore, it’s macro.\n\nSome analysts still see patterns that look like the old four year rhythm, but it’s probably just coincidence. The underlying driver has changed. Bitcoin now trades like a liquidity sensitive global asset, not a retail hype machine following a calendar.\n\nThis shift also changes how traders need to think about timing and taxes. When Bitcoin moved on predictable four year cycles, tax planning was straightforward - you could time long term capital gains around halvings. Now that moves are tied to unpredictable central bank decisions, tracking cost basis across multiple entries and exits becomes more critical. Platforms like awaken.tax are seeing this reflected in usage patterns as traders make more frequent portfolio adjustments based on policy signals rather than waiting for halving milestones.\n\nIf Washington or Beijing suddenly tightened again, Bitcoin would correct hard, halving or not. So instead of obsessing over block rewards and countdown clocks, it might be smarter to watch central bank balance sheets and money supply charts.\n\nThe new Bitcoin cycle isn’t four years anymore. It’s whenever the money printers turn on or off.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:17.506778"}
{"post_id": "1o22wnm", "cluster_id": "CryptoMarkets", "title": "Pathetic alt season..", "author": "Straticci4", "score": 23, "num_comments": 65, "created_utc": 1760007697.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o22wnm/pathetic_alt_season/", "permalink": "/r/CryptoMarkets/comments/1o22wnm/pathetic_alt_season/", "selftext": "I'm sure I'm not the only one here but all I hear from so called experts on market cycle theory is alt coin season imminent blah blah blah. I mean a select few moved in 2024 but even now guys like Alex becker still pushing for a crazy alt season and I just don't see it especially if most are expecting a bitcoin top in December. Everyone seems to be moving the goal post on this so called alt season everyone saying rate cuts rate cuts bullish. Yet kf u look back at history most beginning of rate cuts triggered a bear market in the stock market. Not to mention the economy weakening not a single soul I talk to gives a bleep about stocks or crypto. At this point it just feels like coping.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:16.454585"}
{"post_id": "1o26tcx", "cluster_id": "CryptoMarkets", "title": "Binance founder CZ announces that BNB Chain gas fees have dropped by 2000% this year.", "author": "Whole-Kaleidoscope29", "score": 11, "num_comments": 17, "created_utc": 1760018681.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o26tcx/binance_founder_cz_announces_that_bnb_chain_gas/", "permalink": "/r/CryptoMarkets/comments/1o26tcx/binance_founder_cz_announces_that_bnb_chain_gas/", "selftext": "Lower gas fees make the BNB Chain faster and more affordable, encouraging more users and developers to build on the network. Thoughts?", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:16.454585"}
{"post_id": "1nyvt0k", "cluster_id": "CryptoMarkets", "title": "watched bitcoin go from 40k to 125k and somehow made nothing. lost most of it somewhere else instead", "author": "dumble_hold_the_door", "score": 142, "num_comments": 69, "created_utc": 1759688523.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1nyvt0k/watched_bitcoin_go_from_40k_to_125k_and_somehow/", "permalink": "/r/CryptoMarkets/comments/1nyvt0k/watched_bitcoin_go_from_40k_to_125k_and_somehow/", "selftext": "january 2024, bitcoin was around 42k. i kept checking prices every day, waiting for the perfect entry. 45k hit, then 50k, 60k, 70k. every time i thought, “too late, it’ll correct soon.”\n\nfinally bought a small amount at 50k. not much, because this had to be near the top. bitcoin kept climbing anyway. my position barely moved compared to the overall rally.\n\nthat’s when the solana casino started looking tempting. memes, screenshots, 50x overnight gains. bitcoin felt slow, safe, boring.\n\nso i jumped in. first few meme coins worked , doubled here, tripled there. then came the dumps. 80 percent gone in two days. liquidity vanished. stop losses didn’t matter when there was no one to sell to.\n\nmeanwhile bitcoin kept pushing , 80k, 90k, 100k, 120k, 125k. i watched the whole move while trying to make back sol losses.\n\nended up with less than if i’d just bought bitcoin once and forgotten about it.\n\nthe real lesson? checking charts every day doesn’t make you smart, it makes you emotional. you start seeing every dip as danger, every pump as too late, and every sideways move as a waste of time.\n\nyour brain craves bigger moves. bitcoin up 10 percent feels dull. you start needing the casino.\n\nthe ones who made money weren’t on telegram chasing 100x coins. they bought bitcoin, closed the tab, and lived their lives.\n\ni watched bitcoin triple and still ended down... not because i was dumb, but because i paid too much attention.\n\nfunny enough, when i finally started using awaken.tax to sync my trades, i could actually see how much i’d overtraded. every flip, every panic move right there in the report. hurt to look at, but that’s when i learned what “less is more” really means.\n\nstop checking the charts.", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:17.525496"}
{"post_id": "1nxs4c9", "cluster_id": "CryptoMarkets", "title": "Btc 2026 bear market", "author": "Revolutionary_Sea159", "score": 102, "num_comments": 296, "created_utc": 1759579303.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1nxs4c9/btc_2026_bear_market/", "permalink": "/r/CryptoMarkets/comments/1nxs4c9/btc_2026_bear_market/", "selftext": "Hi everyone, \n\nBear market is coming in 2026 , probably.\n\nWe are closer to the top than to buttom.\n\nWhat are your predictions for this bear cycle?\n\nWill we see 50k ? 60k? 70k?80k?\n\nI know that no one can see the future.\n\nDo you think the bear market (if it happens) will last\n\n more than 1 year? \n\nPlease share your thoughts and predictions.\n\nThank you!!!!\n \n******This is not financial advice, only\n\n informational******\n\n\n\n", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:17.525496"}
{"post_id": "1o2scjv", "cluster_id": "CryptoMarkets", "title": "Eth to btc", "author": "SteelixTheGoat", "score": 2, "num_comments": 2, "created_utc": 1760073641.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o2scjv/eth_to_btc/", "permalink": "/r/CryptoMarkets/comments/1o2scjv/eth_to_btc/", "selftext": "I’ve made abit of money dollar cost averaging into eth and I believe in its future just feel Bitcoin will hold its value, how far will eth go down this next bear market or is it seen as a store of value now? ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:16.522874"}
{"post_id": "1o2gfae", "cluster_id": "CryptoMarkets", "title": "The Empty Chair: Why Satoshi Nakamoto's Silence is Bitcoin's Loudest Statement. The power doesn’t reside in the chair; it resides everywhere. And that, as Satoshi Nakamoto knew, is the entire point.", "author": "sylsau", "score": 11, "num_comments": 3, "created_utc": 1760040574.0, "url": "https://inbitcoinwetrust.substack.com/p/the-empty-chair-why-satoshi-nakamotos", "permalink": "/r/CryptoMarkets/comments/1o2gfae/the_empty_chair_why_satoshi_nakamotos_silence_is/", "selftext": "", "is_self": false, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:16.522874"}
{"post_id": "1o2rc6i", "cluster_id": "CryptoMarkets", "title": "Do you transfer money after cashing out?", "author": "Several_Structure418", "score": 0, "num_comments": 4, "created_utc": 1760070254.0, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1o2rc6i/do_you_transfer_money_after_cashing_out/", "permalink": "/r/CryptoMarkets/comments/1o2rc6i/do_you_transfer_money_after_cashing_out/", "selftext": "When you are selling on the exchange at various price targets, do you immediately send to the bank or do you wait until everything is cashed out? \nMy concern is maybe my bank not liking these transactions coming in.  ", "is_self": true, "over_18": false, "spoiler": false, "stickied": false, "discovered_at": "2025-10-10T15:31:17.645111"}
